# Python version on excel

In [80]:
import numpy as np
import pandas as pd

# Series

In [6]:
label = ["a","b","c"]
my_data = [10,20,30]
arr = np.array(my_data)
dic = {"a":10,"b":20,"c":30}

In [8]:
label

# my_data

# arr

# dic

['a', 'b', 'c']

In [9]:
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

In [14]:
pd.Series(data = my_data, index = label)

a    10
b    20
c    30
dtype: int64

In [15]:
pd.Series(arr, label)

a    10
b    20
c    30
dtype: int32

In [16]:
pd.Series(dic)

a    10
b    20
c    30
dtype: int64

In [17]:
ser1 = pd.Series([1,2,3,4], ["USA", "UK","USSR","UAE"])

In [18]:
ser2 = pd.Series([1,2,5,4], ["USA", "UK","PAK","UAE"])

In [19]:
ser3 = pd.Series(label)

In [20]:
ser3

0    a
1    b
2    c
dtype: object

In [21]:
ser1

USA     1
UK      2
USSR    3
UAE     4
dtype: int64

In [22]:
ser2

USA    1
UK     2
PAK    5
UAE    4
dtype: int64

In [23]:
ser1 + ser2

PAK     NaN
UAE     8.0
UK      4.0
USA     2.0
USSR    NaN
dtype: float64

# DATAFRAME

In [24]:
from numpy.random import randn

In [29]:
seed = np.random.seed(101)

In [27]:
df = pd.DataFrame(randn(5,4), ["a","b","c","d","e"],["w","x","y","z"])

In [28]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [31]:
df["new"]= df["w"] + df["y"]

In [32]:
df

          w         x         y         z       new
a  2.706850  0.628133  0.907969  0.503826  3.614819
b  0.651118 -0.319318 -0.848077  0.605965 -0.196959
c -2.018168  0.740122  0.528813 -0.589001 -1.489355
d  0.188695 -0.758872 -0.933237  0.955057 -0.744542
e  0.190794  1.978757  2.605967  0.683509  2.796762

In [33]:
df.drop("new")

KeyError: "['new'] not found in axis"

In [34]:
df.drop("new", axis= 1)

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [35]:
# df.drop("new", axis=1, inplace= True)

In [38]:
df.shape

(5, 4)

In [40]:
df.loc["a"]

w    2.706850
x    0.628133
y    0.907969
z    0.503826
Name: a, dtype: float64

In [41]:
df.iloc[2]

w   -2.018168
x    0.740122
y    0.528813
z   -0.589001
Name: c, dtype: float64

In [42]:
df.loc['a','x']

0.6281327087844596

In [43]:
df.loc[['a','b'],["w",'z']]

          w         z
a  2.706850  0.503826
b  0.651118  0.605965

In [44]:
df > 0

       w      x      y      z
a   True   True   True   True
b   True  False  False   True
c  False   True   True  False
d   True  False  False   True
e   True   True   True   True

In [45]:
boolF = df > 0

df[boolF]

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118       NaN       NaN  0.605965
c       NaN  0.740122  0.528813       NaN
d  0.188695       NaN       NaN  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [46]:
df[df['w'] > 0]

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [47]:
df[df['z']<0]

          w         x         y         z
c -2.018168  0.740122  0.528813 -0.589001

In [51]:
df[df['w']> 0][['z','x']]

          z         x
a  0.503826  0.628133
b  0.605965 -0.319318
d  0.955057 -0.758872
e  0.683509  1.978757

In [52]:
boolser = df['w']> 0
result = df[boolser]
col = ['z','x']
result[col]

          z         x
a  0.503826  0.628133
b  0.605965 -0.319318
d  0.955057 -0.758872
e  0.683509  1.978757

In [70]:
df[(df['w']>0) & (df["y"] > 1)]

          w         x         y         z
e  0.190794  1.978757  2.605967  0.683509

In [71]:
df.reset_index()

  index         w         x         y         z
0     a  2.706850  0.628133  0.907969  0.503826
1     b  0.651118 -0.319318 -0.848077  0.605965
2     c -2.018168  0.740122  0.528813 -0.589001
3     d  0.188695 -0.758872 -0.933237  0.955057
4     e  0.190794  1.978757  2.605967  0.683509

In [73]:
newInd = "CA NY CH, WS, ST".split()

In [74]:
newInd

['CA', 'NY', 'CH,', 'WS,', 'ST']

In [75]:
df['State']= newInd

In [76]:
df

          w         x         y         z State
a  2.706850  0.628133  0.907969  0.503826    CA
b  0.651118 -0.319318 -0.848077  0.605965    NY
c -2.018168  0.740122  0.528813 -0.589001   CH,
d  0.188695 -0.758872 -0.933237  0.955057   WS,
e  0.190794  1.978757  2.605967  0.683509    ST

In [78]:
df.set_index("State")

              w         x         y         z
State
CA     2.706850  0.628133  0.907969  0.503826
NY     0.651118 -0.319318 -0.848077  0.605965
CH,   -2.018168  0.740122  0.528813 -0.589001
WS,    0.188695 -0.758872 -0.933237  0.955057
ST     0.190794  1.978757  2.605967  0.683509

# Missing Value

In [120]:
check = {'A':[1,2,np.nan],'B':[4,np.nan, np.nan],'C':[7,8,9]}

In [121]:
df1 = pd.DataFrame(check)

In [122]:
df1

     A    B  C
0  1.0  4.0  7
1  2.0  NaN  8
2  NaN  NaN  9

In [123]:
df1.dropna()

     A    B  C
0  1.0  4.0  7

In [124]:
df1.dropna(1, thresh=2)

     A  C
0  1.0  7
1  2.0  8
2  NaN  9

In [125]:
df1.dropna(1)

   C
0  7
1  8
2  9

In [126]:
df1.fillna(value="N/A")

     A    B  C
0  1.0  4.0  7
1  2.0  N/A  8
2  N/A  N/A  9

In [132]:
df1['A'].fillna(value= df1["A"].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [133]:
df1

     A    B  C
0  1.0  4.0  7
1  2.0  NaN  8
2  NaN  NaN  9

# GroupBy

In [160]:
data = {
    'Company':["GOOG","GOOG",'MSFT','MSFT','FB','FB'],
    "Person": ['SR',"hi",'sy',"sm","sl",'hy'],
    "Sales":[10,20,30,40,50,60]
}

In [161]:
df_g = pd.DataFrame(data)

In [162]:
df_g

  Company Person  Sales
0    GOOG     SR     10
1    GOOG     hi     20
2    MSFT     sy     30
3    MSFT     sm     40
4      FB     sl     50
5      FB     hy     60

In [163]:
byComp = df_g.groupby("Company")

In [164]:
byComp

In [165]:
byComp.mean()

         Sales
Company
FB          55
GOOG        15
MSFT        35

In [166]:
byComp.max()

        Person  Sales
Company
FB          sl     60
GOOG        hi     20
MSFT        sy     40

In [167]:
byComp.sum()

         Sales
Company
FB         110
GOOG        30
MSFT        70

In [168]:
byComp.std()

            Sales
Company
FB       7.071068
GOOG     7.071068
MSFT     7.071068

In [170]:
byComp.sum().loc["FB"]

Sales    110
Name: FB, dtype: int64

In [171]:
byComp.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [172]:
 byComp.max()

        Person  Sales
Company
FB          sl     60
GOOG        hi     20
MSFT        sy     40

In [173]:
byComp.describe()

        Sales
        count  mean       std   min   25%   50%   75%   max
Company
FB        2.0  55.0  7.071068  50.0  52.5  55.0  57.5  60.0
GOOG      2.0  15.0  7.071068  10.0  12.5  15.0  17.5  20.0
MSFT      2.0  35.0  7.071068  30.0  32.5  35.0  37.5  40.0

In [175]:
byComp.describe().transpose()

Company             FB       GOOG       MSFT
Sales count   2.000000   2.000000   2.000000
      mean   55.000000  15.000000  35.000000
      std     7.071068   7.071068   7.071068
      min    50.000000  10.000000  30.000000
      25%    52.500000  12.500000  32.500000
      50%    55.000000  15.000000  35.000000
      75%    57.500000  17.500000  37.500000
      max    60.000000  20.000000  40.000000

In [180]:
byComp.describe().transpose()["FB"]

Sales  count     2.000000
       mean     55.000000
       std       7.071068
       min      50.000000
       25%      52.500000
       50%      55.000000
       75%      57.500000
       max      60.000000
Name: FB, dtype: float64

#  OPERATION

In [1]:
import numpy as np
import pandas as pd

In [8]:
df = pd.DataFrame({"col1":[1,2,3,4],
                 "col2": [444,555,666,444],
                 "col3":['abc','def','ghi','jkl']})

In [7]:
df

(   col1  col2 col3
 0     1   444  abc
 1     2   555  def
 2     3   666  ghi
 3     4   444  jkl,)

In [9]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  jkl

In [10]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [11]:
df['col2'].nunique()

3

In [12]:
df['col2'].value_counts()

444    2
666    1
555    1
Name: col2, dtype: int64

In [13]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  jkl

In [14]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  jkl

In [15]:
df[df['col1'] > 2]

   col1  col2 col3
2     3   666  ghi
3     4   444  jkl

In [18]:
boolOper = df['col1'] > 2

In [17]:
df[boolOper]

   col1  col2 col3
2     3   666  ghi
3     4   444  jkl

In [19]:
def times2(x):
    return x**2

In [25]:
df['col1'].apply(times2)

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [26]:
df['col1'].apply(lambda x:x**2)

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [33]:
df.drop("col1",axis = 1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  jkl

In [34]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [35]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [37]:
df.sort_values(by = 'col2')

   col1  col2 col3
0     1   444  abc
3     4   444  jkl
1     2   555  def
2     3   666  ghi

In [38]:
data = {
    'A':["foo","foo",'foo','bar','bar','bar'],
    'B': ['one','one','one','two','one','one'],
    'C': ['x','y','x','y','x','y'],
    'D' : [1,3,2,5,4,1]
}

In [47]:
df = pd.DataFrame(data)

df

In [41]:
df['B'].unique()

array(['one', 'two'], dtype=object)

In [49]:
df.pivot_table(values = 'D', index= ['A','B'], columns= ['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.5  3.0

# INPUT & OUTPUT

### csv
### excel
### html
### sql

In [50]:
 import pandas as pd

In [52]:
pd.read_csv('example.csv')

,1,"Eldon Base for stackable storage shelf, platinum",Muhammed MacIntyre,3,-213.25,38.94,35,Nunavut,Storage & Organization,0.8
0,2,"1.7 Cubic Foot Compact ""Cube"" Office Refrigera...",Barry French,293,457.81,208.16,68.02,Nunavut,Appliances,0.58
1,3,"Cardinal Slant-D Ring Binder, Heavy Gauge Vinyl",Barry French,293,46.71,8.69,2.99,Nunavut,Binders and Binder Accessories,0.39
2,4,R380,Clay Rozendal,483,1198.97,195.99,3.99,Nunavut,Telephones and Communication,0.58
3,5,Holmes HEPA Air Purifier,Carlos Soltero,515,30.94,21.78,5.94,Nunavut,Appliances,0.50
4,6,G.E. Longer-Life Indoor Recessed Floodlight Bulbs,Carlos Soltero,515,4.43,6.64,4.95,Nunavut,Office Furnishings,0.37
5,7,"Angle-D Binders with Locking Rings, Label Holders",Carl Jackson,613,-54.04,7.30,7.72,Nunavut,Binders and Binder Accessories,0.38
6,8,"SAFCO Mobile Desk Side File, Wire Frame",Carl Jackson,613,127.70,42.76,6.22,Nunavut,Storage & Organization,NaN
7,9,"SAFCO Commercial Wire Shelving, Black",Monica Federle,643,-695.26,138.14,35.00,Nunavut,Storage & Organization,NaN
8,10,Xerox 198,Dorothy Badders,678,-226.36,4.98,8.33,Nunavut,Paper,0.38

In [57]:
df.to_csv("output", index=False)

In [58]:
pd.read_csv('output')

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  one  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [55]:
df.to_csv("output", index=True)

In [56]:
pd.read_csv('output')

   Unnamed: 0    A    B  C  D
0           0  foo  one  x  1
1           1  foo  one  y  3
2           2  foo  one  x  2
3           3  bar  two  y  5
4           4  bar  one  x  4
5           5  bar  one  y  1

In [65]:
pd.read_excel('excel_sample.xls',sheet_name="Sheet1")

,1,"Eldon Base for stackable storage shelf, platinum",Muhammed MacIntyre,3,-213.25,38.94,35,Nunavut,Storage & Organization,0.8
0,2,"1.7 Cubic Foot Compact ""Cube"" Office Refrigera...",Barry French,293,457.8100,208.16,68.02,Nunavut,Appliances,0.58
1,3,"Cardinal Slant-D Ring Binder, Heavy Gauge Vinyl",Barry French,293,46.7075,8.69,2.99,Nunavut,Binders and Binder Accessories,0.39
2,4,R380,Clay Rozendal,483,1198.9710,195.99,3.99,Nunavut,Telephones and Communication,0.58
3,5,Holmes HEPA Air Purifier,Carlos Soltero,515,30.9400,21.78,5.94,Nunavut,Appliances,0.50
4,6,G.E. Longer-Life Indoor Recessed Floodlight Bulbs,Carlos Soltero,515,4.4300,6.64,4.95,Nunavut,Office Furnishings,0.37
...,...,...,...,...,...,...,...,...,...,...
994,996,Xerox 1905,Dennis Bolton,48165,-147.2700,6.48,9.54,British Columbia,Paper,0.37
995,997,Dana Halogen Swing-Arm Architect Lamp,Anthony O'Donnell,48197,154.7400,40.97,14.45,British Columbia,Office Furnishings,0.57
996,998,Maxell DVD-RAM Discs,Barbara Fisher,48484,67.9600,16.48,1.99,British Columbia,Computer Peripherals,0.42
997,999,DAX Contemporary Wood Frame with Silver Metal ...,Barbara Fisher,48484,133.8300,20.24,6.67,British Columbia,Office Furnishings,0.49
998,1000,Computer Printout Paper with Letter-Trim Perfo...,Barbara Fisher,48484,153.8000,18.97,9.03,British Columbia,Paper,0.37

In [68]:
bank = pd.read_html("https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/")

In [69]:
type(bank)

list

In [77]:
bank[0].head()

,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020",10538
1,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020",10537
2,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020",10536
3,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020",10535
4,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019",10534